//// функция-предикат определяет, является ли число num четным
//const isEven = num => num % 2 === 0;
//// функция увеличивает полученное число num на 10
//const increaseNum = num => num + 10;
//
//const num = 6;
//const result = isEven(increaseNum(num) + 1) ? num + 1 : 1 - num;
//console.log(result);
// функция-предикат определяет, является ли число num четным
//const isEven = num => num % 2 === 0;
//// функция увеличивает полученное число num на 10
//const increaseNum = num => num + 10;
//let result = isEven(increaseNum(num) + 1) ? num + 1 : 1 - num;
/*Функция возвращает: число (итоговую оценку).

Есть четыре возможных итоговых оценки:

100, если оценка за экзамен выше 90 или есть больше 10 проектов
90, если оценка за экзамен выше 75 и есть как минимум 5 проектов
75, если оценка за экзамен выше 50 и есть как минимум 2 проекта
0 в любом другом случае*/

